src/InformationRegisters/НастройкиУчетаМаркируемойПродукцииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаМаркируемойПродукцииИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбязательногоВключенияРазрешительногоРежима</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостоянияCDNПлощадокИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияCDNПлощадокИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СреднееВремяПроверкиКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНедоступнаДоУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АдресПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МинимальныеЦеныПодакцизныхТоваровИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МинимальныеЦеныПодакцизныхТоваровИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПодакцизногоТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТоваровИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КрепостьНижняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КрепостьВерхняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКонтроляЦенПодакцизныхТоваровИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыПодакцизныхТоваровИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПодакцизныхТоваровИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Водка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияКрепостьюСвыше28ПроцентовКромеВодки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрендиИАлкогольнаяПродукцияИзВинныхДистилятов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коньяк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МясоПодконтрольноеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияДо9Процентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПивоВПотребительскихУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ОбщегоНазначенияИСМП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак полной версии БГосИС
// 
// Возвращаемое значение:
//  Булево - Это расширенная версия гос ИС
Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС("ИСМП");
	
КонецФункции

// Виды продукции обязательной маркировки.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из ПеречислениеСсылка.ВидыПродукцииИС - Виды продукции обязательной маркировки
Функция ВидыПродукцииОбязательнойМаркировки() Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВидыПродукцииОбязательнойМаркировки(НачалоДня(ТекущаяДатаСеанса()));
	
КонецФункции

Функция ВестиУчетМаркируемойПродукции(ВидМаркируемойПродукции) Экспорт
	
	ИмяФункциональнойОпцииВестиУчет = "";
	
	Если ЭтоРасширеннаяВерсияГосИС() Тогда
		ИмяФункциональнойОпцииВестиУчет = "ВестиУчетМаркируемойПродукцииИСМП";
	Иначе
		ИмяФункциональнойОпцииВестиУчет = "ВестиУчетМаркируемойПродукцииИСМПРМК";
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпцииВестиУчет) Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВестиУчетПродукции КАК ВестиУчетПродукции
		|ИЗ
		|	РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП
		|ГДЕ
		|	ВидПродукции = &ВидМаркируемойПродукции
		|";

		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ВидМаркируемойПродукции", ВидМаркируемойПродукции);

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			Возврат Ложь;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.ВестиУчетПродукции;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Используется маркируемая продукция.
// 
// Возвращаемое значение:
//  Булево - Используется маркируемая продукция
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Если ЭтоРасширеннаяВерсияГосИС() Тогда
		//@skip-check wrong-string-literal-content
		Возврат ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
	Иначе
		Возврат ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМПРМК");
	КонецЕсли;
	
КонецФункции

#Область JSON

// Получить из текста JSON структуру.
// 
// Параметры:
// 	ТекстJSON                    - Строка - Текст JSON.
// 	ПреобразовыватьВСоответствие - Булево - Признак преобразования в соответствие.
// Возвращаемое значение:
// 	Структура, Неопределено, Произвольный - Результат преобразования JSON.
Функция ТекстJSONВОбъект(ТекстJSON, ПреобразовыватьВСоответствие = Ложь) Экспорт
	
	Возврат ОбщегоНазначенияИС.ТекстJSONВОбъект(ТекстJSON, ПреобразовыватьВСоответствие);
	
КонецФункции

// Формирует из структуры текст JSON
// Параметры:
//  ДанныеСтруктура - Структура из КлючИЗначение - Данные для конвертации в текст JSON
//  УдалитьПробелыИПереносыСтрок - Булево - признак, удалять ли пробелы и переносы из конечной строки JSON
// 
// Возвращаемое значение:
// 	Строка - Текст JSON
Функция ОбъектВТекстJSON(ДанныеСтруктура, УдалитьПробелыИПереносыСтрок = Ложь) Экспорт
	
	Возврат ОбщегоНазначенияИС.ОбъектВТекстJSON(ДанныеСтруктура, УдалитьПробелыИПереносыСтрок);
	
КонецФункции

Функция ФорматироватьЛогЗапросов(ИсходныйТекст, ДополнительныеПараметры) Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.УстановитьТекст(ИсходныйТекст);
	
	КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	Если КоличествоСтрок = 0 Тогда
		Возврат ИсходныйТекст;
	КонецЕсли;
	
	КлючиРазворачиванияBASE64 = Новый Соответствие();
	КлючиРазворачиванияBASE64.Вставить("product_document");
	
	Для СмещениеСКонца = 0 По КоличествоСтрок - 1 Цикл
		
		НомерСтрокиСКонца = КоличествоСтрок - СмещениеСКонца;
		ТекущаяСтрока     = ТекстовыйДокумент.ПолучитьСтроку(НомерСтрокиСКонца);
		ДанныеСтроки      = Новый Массив();
		Если СтрНачинаетсяС(ТекущаяСтрока, "{")
			Или СтрНачинаетсяС(ТекущаяСтрока, "[") Тогда
			Попытка
				ДанныеСтроки.Добавить(ОбщегоНазначенияИС.ФорматироватьJSON(ТекущаяСтрока, Ложь, КлючиРазворачиванияBASE64));
			Исключение
				Продолжить;
			КонецПопытки;
		Иначе
			Продолжить;
		КонецЕсли;
		
		ТекстовыйДокумент.УдалитьСтроку(НомерСтрокиСКонца);
		ТекстовыйДокумент.ВставитьСтроку(НомерСтрокиСКонца, СтрСоединить(ДанныеСтроки, Символы.ПС));
		
	КонецЦикла;
	
	Возврат СокрЛП(ТекстовыйДокумент.ПолучитьТекст());
	
КонецФункции

#КонецОбласти

#Область XDTO

// Преобразует объект XDTO в XML
//
// Параметры:
//  ОбъектXDTO          - ОбъектXDTO - Объект XDTO
//  ИмяТипа             - Строка     - Имя типа.
//  ИспользоватьОтступы - Булево     - Использование отступов.
// Возвращаемое значение:
//  Строка - Текст сообщения XML
//
Функция ОбъектXDTOВXML(ОбъектXDTO, ИмяТипа = "Файл", ИспользоватьОтступы = Ложь) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(РаботаСXMLИС.ПараметрыФорматированияXML(ИспользоватьОтступы));
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO, ИмяТипа);
	
	ТекстXML = ЗаписьXML.Закрыть();
	
	ТекстыИсключения = Новый Массив();
	ТекстыИсключения.Добавить("d2p1:");
	ТекстыИсключения.Добавить("d4p1:");
	ТекстыИсключения.Добавить("xmlns=""""");
	ТекстыИсключения.Добавить("xmlns=""http://www.w3.org/2001/XMLSchema""");
	ТекстыИсключения.Добавить("xmlns:xs=""http://www.w3.org/2001/XMLSchema""");
	ТекстыИсключения.Добавить("xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""");
	
	Если ЭтоРасширеннаяВерсияГосИС() Тогда
		ТекстыИсключения.Добавить(СтрШаблон("xmlns:d2p1=""%1""", Метаданные.ПакетыXDTO["ТипыМОТП"].ПространствоИмен));
		ТекстыИсключения.Добавить(СтрШаблон("xmlns:d2p1=""%1""", Метаданные.ПакетыXDTO["АгрегацияМОТП"].ПространствоИмен));
		ТекстыИсключения.Добавить(СтрШаблон("xmlns:d2p1=""%1""", Метаданные.ПакетыXDTO["ВыбытиеМОТП"].ПространствоИмен));
		ТекстыИсключения.Добавить(СтрШаблон("xmlns=""%1""",      Метаданные.ПакетыXDTO["АгрегацияМОТП"].ПространствоИмен));
		ТекстыИсключения.Добавить(СтрШаблон("xmlns=""%1""",      Метаданные.ПакетыXDTO["ВыбытиеМОТП"].ПространствоИмен));
	КонецЕсли;
	
	Для Каждого СтрокаПоиска Из ТекстыИсключения Цикл
		Если ИспользоватьОтступы Тогда
			ТекущаяСтрокаПоиска = СтрокаПоиска + Символы.ПС;
		Иначе
			ТекущаяСтрокаПоиска = СтрокаПоиска;
		КонецЕсли;
		ТекстXML = СтрЗаменить(ТекстXML, ТекущаяСтрокаПоиска, "");
	КонецЦикла;
	
	Возврат ТекстXML;
	
КонецФункции

#КонецОбласти

#Область HTTPЗапросы

Функция ПолучитьДанныеИзСервиса(АдресЗапроса, КлючСессии, ПараметрыОтправкиHTTPЗапросов, ЗаголовокHTTP = Неопределено, HTTPОтветЭмуляция = Неопределено) Экспорт
	
	Если ПараметрыОтправкиHTTPЗапросов.Свойство("ДатаПоследнегоЗапроса") Тогда
		ВремяОжиданияСледующегоЗапроса = ВремяОжиданияСледующегоЗапросаСУЗ(ПараметрыОтправкиHTTPЗапросов);
		Если ВремяОжиданияСледующегоЗапроса > 0 Тогда
			ОбщегоНазначенияИС.Ожидать(ВремяОжиданияСледующегоЗапроса, ПараметрыОтправкиHTTPЗапросов);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаголовокHTTP = Неопределено Тогда
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
		ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
		ЗаголовокHTTP.Вставить("Cache-Control",  "no-cache");
		Если КлючСессии <> Неопределено Тогда
			ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
		КонецЕсли;
	КонецЕсли;
	
	HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, ЗаголовокHTTP);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	Если ПараметрыОтправкиHTTPЗапросов.ИспользоватьЗащищенноеСоединение Тогда
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
		ЗащищенноеСоединение = ОбщегоНазначенияИСПовтИсп.ЗащищенноеСоединение();
	Иначе
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTP");
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Если HTTPОтветЭмуляция = Неопределено Тогда
		
		Попытка
			
			Соединение = Новый HTTPСоединение(
				ПараметрыОтправкиHTTPЗапросов.Сервер,
				ПараметрыОтправкиHTTPЗапросов.Порт,,,
				ИнтернетПрокси,
				ПараметрыОтправкиHTTPЗапросов.Таймаут,
				ЗащищенноеСоединение);
			
			HTTPОтвет = Соединение.Получить(HTTPЗапрос);
			
		Исключение
			
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписьЖурналаРегистрации(
				ПараметрыОтправкиHTTPЗапросов.ПредставлениеСервиса,
				УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон(
					НСтр("ru = 'Ошибка при выполнении запроса GET %1 в %2 %3:%4'"),
					АдресЗапроса,
					ПараметрыОтправкиHTTPЗапросов.ПредставлениеСервиса,
					ПараметрыОтправкиHTTPЗапросов.Сервер,
					ПараметрыОтправкиHTTPЗапросов.Порт) + Символы.ПС +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	Иначе
		
		HTTPОтвет = HTTPОтветЭмуляция;
		
	КонецЕсли;
	
	ПутьКФайлу = Неопределено;
	ОбщегоНазначенияИСМППереопределяемый.ПриОпределенииПутиКФайлуЛогирования(ПутьКФайлу);
	Если ПутьКФайлу <> Неопределено Тогда
		ВывестиHTTPЗапросВЛог(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, "GET", ПутьКФайлу);
		ВывестиHTTPЗапросВЛог(HTTPОтвет,  Неопределено, Неопределено, ПутьКФайлу, ТекстОшибки);
	КонецЕсли;
	
	ПараметрыЛогированияЗапросов = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	ДанныеЗаписи                 = ЛогированиеЗапросовИС.НоваяСтруктураДанныхЗаписи();
	ДанныеЗаписи.HTTPЗапросОтвет = HTTPЗапрос;
	ДанныеЗаписи.HTTPМетод       = "GET";
	ДанныеЗаписи.АдресРесурса    = URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, ДанныеЗаписи.HTTPМетод);
	ЛогированиеЗапросовИС.Вывести(ДанныеЗаписи, ПараметрыЛогированияЗапросов);
	
	ДанныеЗаписи                 = ЛогированиеЗапросовИС.НоваяСтруктураДанныхЗаписи();
	ДанныеЗаписи.HTTPЗапросОтвет = HTTPОтвет;
	ДанныеЗаписи.ТекстОшибки     = ТекстОшибки;
	ЛогированиеЗапросовИС.Вывести(ДанныеЗаписи, ПараметрыЛогированияЗапросов);
	
	Если ПараметрыОтправкиHTTPЗапросов.Свойство("ДатаПоследнегоЗапроса") Тогда
		ПараметрыОтправкиHTTPЗапросов.ДатаПоследнегоЗапроса = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПараметрыОтправкиHTTPЗапросов", ПараметрыОтправкиHTTPЗапросов);
	ВозвращаемоеЗначение.Вставить("HTTPМетод",                     "GET");
	ВозвращаемоеЗначение.Вставить("HTTPЗапрос",                    HTTPЗапрос);
	ВозвращаемоеЗначение.Вставить("HTTPОтвет",                     HTTPОтвет);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                   ТекстОшибки);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВремяОжиданияСледующегоЗапросаСУЗ(НастройкаОбмена) Экспорт
	
	РазрешеннаяДатаСледующегоЗапроса = НастройкаОбмена.ДатаПоследнегоЗапроса + НастройкаОбмена.ИнтервалМеждуЗапросами;
	ВремяОжиданияСледующегоЗапроса = РазрешеннаяДатаСледующегоЗапроса - ТекущаяДатаСеанса();
	Если ВремяОжиданияСледующегоЗапроса < 0 Тогда
		ВремяОжиданияСледующегоЗапроса = 0;
	КонецЕсли;
	
	Возврат ВремяОжиданияСледующегоЗапроса;
	
КонецФункции

// Структура результата HTTP запроса
// 
// Возвращаемое значение:
// 	Структура - Результат HTTP-запроса:
// * КодСостояния - Число        - Код состояния HTTP
// * Заголовки    - Соответствие - Заголовки HTTP ответа
// * ТекстОтвета  - Строка       - Текст ответа
// * ТекстОшибки  - Строка       - Текст ошибки
Функция РезультатHTTPЗапроса() Экспорт
	
	РезультатHTTPЗапроса = Новый Структура;
	РезультатHTTPЗапроса.Вставить("КодСостояния");
	РезультатHTTPЗапроса.Вставить("Заголовки");
	РезультатHTTPЗапроса.Вставить("ТекстОтвета");
	РезультатHTTPЗапроса.Вставить("ТекстОшибки");
	
	Возврат РезультатHTTPЗапроса;
	
КонецФункции

// Инициализирует структуру результата обработки HTTP-запроса после получения ответа.
// 
// Параметры:
// 	ТекстВходящегоСообщенияJSON - Строка - Текст входящего сообщения.
// 	КодСостояния                - Число  - Код состояния.
// 
// Возвращаемое значение:
// Структура - Структура со свойствами:
//   ЗапросОтправлен             - Булево - признак того, что сообщение отправлено.
//   ОтветПолучен                - Булево - признак того, что сообщение обработано сервером.
//   КодСостояния                - Число  - Код состояния HTTP-запроса.
//   ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//   ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
//
Функция HTTPОтветПолучен(ТекстВходящегоСообщенияJSON, КодСостояния = 200, КакФайл = Ложь, ДополнительныеПараметры = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ВозвращаемоеЗначение.Вставить("ЗапросОтправлен",         Истина);
	ВозвращаемоеЗначение.Вставить("ОтветПолучен",            Истина);
	
	ВозвращаемоеЗначение.Вставить("КодСостояния", КодСостояния);
	ВозвращаемоеЗначение.Вставить("Объект",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",  "");
	
	Если КакФайл Тогда
		ВозвращаемоеЗначение.Вставить("ИмяФайла", ТекстВходящегоСообщенияJSON);
	Иначе
		Попытка
			ВозвращаемоеЗначение.Объект = ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON, Ложь);
		Исключение
			ВозвращаемоеЗначение.Объект = ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON, Истина);
		КонецПопытки;
		
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщения", ТекстВходящегоСообщенияJSON);
		Если ВозвращаемоеЗначение.Объект <> Неопределено Тогда
			ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", ОбъектВТекстJSON(ВозвращаемоеЗначение.Объект));
		Иначе
			ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", ТекстВходящегоСообщенияJSON);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Инициализирует структуру результата обработки HTTP-запроса после отправки сообщения, но до получения ответа.
// 
// Возвращаемое значение:
// Структура:
//   ЗапросОтправлен             - Булево - признак того, что сообщение отправлено.
//   ОтветПолучен                - Булево - признак того, что сообщение получено.
//   КодСостояния                - Число  - Код состояния HTTP-запроса.
//   ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//   ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
//
Функция HTTPОтветНеПолучен(Ошибка, ЗапросОтправлен, КодСостояния = Неопределено, КакФайл = Ложь, ДополнительныеПараметры = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ВозвращаемоеЗначение.Вставить("ЗапросОтправлен",         ЗапросОтправлен);
	ВозвращаемоеЗначение.Вставить("ОтветПолучен",            Ложь);
	
	ВозвращаемоеЗначение.Вставить("КодСостояния", КодСостояния);
	ВозвращаемоеЗначение.Вставить("Объект",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",  Строка(Ошибка));
	
	Если КакФайл Тогда
		ВозвращаемоеЗначение.Вставить("ИмяФайла", "");
	Иначе
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщения",     "");
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", "");
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обработать результат отправки HTTP-запроса к сервису ИС МОТП.
// 
// Параметры:
//  РезультатЗапроса - (См. РезультатЗапроса) - Результат запроса.
// Возвращаемое значение:
// Структура - Результат отправки HTTP-запроса:
//  * ЗапросОтправлен             - Булево - признак того, что сообщение отправлено.
//  * ОтветПолучен                - Булево - признак того, что сообщение получено.
//  * КодСостояния                - Число  - Код состояния HTTP-запроса.
//  * ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//  * ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
Функция ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	РезультатОтправкиHTTPЗапроса = РезультатHTTPЗапроса();
	РезультатОтправкиHTTPЗапроса.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
	Если РезультатЗапроса.HTTPОтвет <> Неопределено Тогда
		РезультатОтправкиHTTPЗапроса.КодСостояния = РезультатЗапроса.HTTPОтвет.КодСостояния;
		РезультатОтправкиHTTPЗапроса.Заголовки    = РезультатЗапроса.HTTPОтвет.Заголовки;
		Если ТипЗнч(РезультатЗапроса.HTTPОтвет) = Тип("Структура") Тогда
			РезультатОтправкиHTTPЗапроса.ТекстОтвета = РезультатЗапроса.HTTPОтвет.Тело;
		Иначе
			РезультатОтправкиHTTPЗапроса.ТекстОтвета = РезультатЗапроса.HTTPОтвет.ПолучитьТелоКакСтроку();
		КонецЕсли;
	КонецЕсли;
	
	КодСостояния = РезультатОтправкиHTTPЗапроса.КодСостояния;
	ТекстОтвета  = РезультатОтправкиHTTPЗапроса.ТекстОтвета;
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		
		ВозвращаемоеЗначение = HTTPОтветПолучен(ТекстОтвета, КодСостояния, Ложь, РезультатЗапроса);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КодСостояния) Тогда
			ТекстСообщенияXMLОтправлен = Ложь;
			ЗаголовокОшибки = НСтр("ru = 'HTTP-запрос не отправлен.'");
		Иначе
			ТекстСообщенияXMLОтправлен = Истина;
			ЗаголовокОшибки = СтрШаблон(НСтр("ru = 'Код состояния HTTP: %1.'"), КодСостояния);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОтправкиHTTPЗапроса.ТекстОшибки) Тогда
			ТекстОшибки = ЗаголовокОшибки + Символы.ПС + РезультатОтправкиHTTPЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ЗаголовокОшибки;
		КонецЕсли;
		
		ВозвращаемоеЗначение = HTTPОтветНеПолучен(
			ТекстОшибки,
			ТекстСообщенияXMLОтправлен,
			КодСостояния,
			Ложь, РезультатЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОтправитьДанныеВСервис(АдресЗапроса, ТелоЗапроса, КлючСессии, HTTPМетод, ПараметрыОтправкиHTTPЗапросов, ЗаголовокHTTP = Неопределено, HTTPОтветЭмуляция = Неопределено, Соединение = Неопределено) Экспорт
	
	РасширенныеОбработкиОтправкиДанныхВСервис(ПараметрыОтправкиHTTPЗапросов);
	
	ЭтоДвоичныеДанные = ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные");
	ЭтоФайл           = ТипЗнч(ТелоЗапроса) = Тип("Файл");
	
	Если ТелоЗапроса <> Неопределено И ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
		ТелоЗапросаJSON = ТелоЗапроса;
	ИначеЕсли ТелоЗапроса <> Неопределено И Не ЭтоДвоичныеДанные И Не ЭтоФайл Тогда
		ТелоЗапросаJSON = ОбъектВТекстJSON(ТелоЗапроса, Истина);
	КонецЕсли;
	
	Если ЗаголовокHTTP = Неопределено Тогда
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
		ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
		Если КлючСессии <> Неопределено Тогда
			ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
		КонецЕсли;
	КонецЕсли;
	
	HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, ЗаголовокHTTP);
	Если ТелоЗапроса <> Неопределено Тогда
		Если ЭтоДвоичныеДанные Тогда
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		ИначеЕсли ЭтоФайл Тогда
			HTTPЗапрос.УстановитьИмяФайлаТела(ТелоЗапроса.ПолноеИмя);
		Иначе
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		КонецЕсли;
	КонецЕсли;
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	Если ПараметрыОтправкиHTTPЗапросов.ИспользоватьЗащищенноеСоединение Тогда
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
		ЗащищенноеСоединение = ОбщегоНазначенияИСПовтИсп.ЗащищенноеСоединение();
	Иначе
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTP");
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Если HTTPОтветЭмуляция = Неопределено Тогда
		
		Попытка
			
			Если Соединение = Неопределено Тогда
				
				Соединение = Новый HTTPСоединение(
					ПараметрыОтправкиHTTPЗапросов.Сервер,
					ПараметрыОтправкиHTTPЗапросов.Порт,,,
					ИнтернетПрокси,
					ПараметрыОтправкиHTTPЗапросов.Таймаут,
					ЗащищенноеСоединение);
					
			КонецЕсли;
			
			Если HTTPМетод = "POST" Тогда
				HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			Иначе
				HTTPОтвет = Соединение.ВызватьHTTPМетод(HTTPМетод, HTTPЗапрос);
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ИСМП'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон(
					НСтр("ru = 'Ошибка при выполнении запроса POST %1 в ИС МП %2'"),
					АдресЗапроса, ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.АдресСервера()) + Символы.ПС +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	Иначе
		
		HTTPОтвет = HTTPОтветЭмуляция;
		
	КонецЕсли;
	
	ПутьКФайлу = Неопределено;
	ОбщегоНазначенияИСМППереопределяемый.ПриОпределенииПутиКФайлуЛогирования(ПутьКФайлу);
	Если ПутьКФайлу <> Неопределено Тогда
		ВывестиHTTPЗапросВЛог(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод, ПутьКФайлу);
		ВывестиHTTPЗапросВЛог(HTTPОтвет,  Неопределено, Неопределено, ПутьКФайлу, ТекстОшибки);
	КонецЕсли;
	
	ПараметрыЛогированияЗапросов = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	ДанныеЗаписи                 = ЛогированиеЗапросовИС.НоваяСтруктураДанныхЗаписи();
	ДанныеЗаписи.HTTPЗапросОтвет = HTTPЗапрос;
	ДанныеЗаписи.АдресРесурса    = URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод);
	ДанныеЗаписи.HTTPМетод       = HTTPМетод;
	ЛогированиеЗапросовИС.Вывести(ДанныеЗаписи, ПараметрыЛогированияЗапросов);
	
	ДанныеЗаписи                 = ЛогированиеЗапросовИС.НоваяСтруктураДанныхЗаписи();
	ДанныеЗаписи.HTTPЗапросОтвет = HTTPОтвет;
	ДанныеЗаписи.ТекстОшибки     = ТекстОшибки;
	ЛогированиеЗапросовИС.Вывести(ДанныеЗаписи, ПараметрыЛогированияЗапросов);
	
	Если ПараметрыОтправкиHTTPЗапросов.Свойство("ДатаПоследнегоЗапроса") Тогда
		ПараметрыОтправкиHTTPЗапросов.ДатаПоследнегоЗапроса = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПараметрыОтправкиHTTPЗапросов", ПараметрыОтправкиHTTPЗапросов);
	ВозвращаемоеЗначение.Вставить("HTTPМетод",                     HTTPМетод);
	ВозвращаемоеЗначение.Вставить("HTTPЗапрос",                    HTTPЗапрос);
	ВозвращаемоеЗначение.Вставить("HTTPОтвет",                     HTTPОтвет);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                   ТекстОшибки);
	
	ЛогированиеЗапросовИСМП.ВывестиДанныеДляПротоколаОбмена(ВозвращаемоеЗначение);

	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Вывести HTTP-Запрос в лог
//
// Параметры:
//  HTTPЗапрос - HTTPЗапрос - HTTP-запрос для вывода в файл.
//             - HTTPОтвет  - HTTP-ответ для вывода в файл.
//  ПараметрыОтправкиHTTPЗапросов - Структура из КлючИЗначение - дополнительные параметры отправки
//  HTTPМетод - Строка - PUT, GET, POST и проч.
//  ПутьКФайлу - Строка - Путь к файлу для записи лога.
//  ТекстОшибки - Строка - текст ошибки выполнения
//
// Возвращаемое значение:
//  Строка - Представление протокола
Функция ВывестиHTTPЗапросВЛог(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод, ПутьКФайлу = Неопределено, ТекстОшибки = "") Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Если ПутьКФайлу <> Неопределено Тогда
		ТекстовыйДокумент.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Если HTTPЗапрос <> Неопределено Тогда
		Если ТипЗнч(HTTPЗапрос) = Тип("HTTPЗапрос") Тогда
			
			Если ТекстовыйДокумент.КоличествоСтрок() > 0 Тогда
				ТекстовыйДокумент.ДобавитьСтроку("");
			КонецЕсли;
			
			URLЗапроса = URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод);
			
			ТекстовыйДокумент.ДобавитьСтроку(URLЗапроса);
		ИначеЕсли ТипЗнч(HTTPЗапрос) = Тип("HTTPОтвет") Тогда
			ТекстовыйДокумент.ДобавитьСтроку("");
			ТекстовыйДокумент.ДобавитьСтроку(СтрШаблон("Код состояния: %1", HTTPЗапрос.КодСостояния));
		ИначеЕсли ТипЗнч(HTTPЗапрос) = Тип("Структура") Тогда
			ТекстовыйДокумент.ДобавитьСтроку("");
			ТекстовыйДокумент.ДобавитьСтроку(НСтр("ru = 'Запрос проксирован через сервис интернет-поддержки'"));
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из HTTPЗапрос.Заголовки Цикл
			
			ЗначениеЗаголовка = КлючИЗначение.Значение;
			
			ТекстовыйДокумент.ДобавитьСтроку(
				СтрШаблон("%1: %2", КлючИЗначение.Ключ, ЗначениеЗаголовка));
			
		КонецЦикла;
		
		Если ТипЗнч(HTTPЗапрос) = Тип("Структура") Тогда
			Тело = HTTPЗапрос.Тело;
		Иначе
			Тело = HTTPЗапрос.ПолучитьТелоКакСтроку();
		КонецЕсли;
		
		Если Не ПустаяСтрока(Тело) Тогда
			ТекстовыйДокумент.ДобавитьСтроку(Тело);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекстОшибки);
	КонецЕсли;
	
	Если ПутьКФайлу <> Неопределено Тогда
		ТекстовыйДокумент.Записать(ПутьКФайлу, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

// Обработать результат отправки HTTP-запроса к сервису ИС МОТП.
// 
// Параметры:
//  РезультатЗапроса - (См. РезультатЗапроса) - Результат запроса.
// Возвращаемое значение:
// Структура - Результат отправки HTTP-запроса:
//  * ЗапросОтправлен - Булево - признак того, что сообщение отправлено.
//  * ОтветПолучен    - Булево - признак того, что сообщение получено.
//  * КодСостояния    - Число  - Код состояния HTTP-запроса.
//  * ТекстОшибки     - Строка - текст ошибки, если таковая возникла.
//  * ИмяФайла        - Строка - ИмяФайла.
Функция ОбработатьРезультатОтправкиHTTPЗапросаКакФайл(РезультатЗапроса) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	РезультатОтправкиHTTPЗапроса = РезультатHTTPЗапроса();
	РезультатОтправкиHTTPЗапроса.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
	Если РезультатЗапроса.HTTPОтвет <> Неопределено Тогда
		РезультатОтправкиHTTPЗапроса.КодСостояния = РезультатЗапроса.HTTPОтвет.КодСостояния;
		РезультатОтправкиHTTPЗапроса.Заголовки    = РезультатЗапроса.HTTPОтвет.Заголовки;
		РезультатОтправкиHTTPЗапроса.ТекстОтвета  = РезультатЗапроса.HTTPОтвет.ПолучитьИмяФайлаТела();
	КонецЕсли;
	
	КодСостояния = РезультатОтправкиHTTPЗапроса.КодСостояния;
	ТекстОтвета  = РезультатОтправкиHTTPЗапроса.ТекстОтвета;
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		
		ВозвращаемоеЗначение = HTTPОтветПолучен(ТекстОтвета, КодСостояния, Истина, РезультатЗапроса);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КодСостояния) Тогда
			ТекстСообщенияXMLОтправлен = Ложь;
			ЗаголовокОшибки = НСтр("ru = 'HTTP-запрос не отправлен.'");
		Иначе
			ТекстСообщенияXMLОтправлен = Истина;
			ЗаголовокОшибки = СтрШаблон(НСтр("ru = 'Код состояния HTTP: %1.'"), КодСостояния);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОтправкиHTTPЗапроса.ТекстОшибки) Тогда
			ТекстОшибки = ЗаголовокОшибки + Символы.ПС + РезультатОтправкиHTTPЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ЗаголовокОшибки;
		КонецЕсли;
		
		ВозвращаемоеЗначение = HTTPОтветНеПолучен(
			ТекстОшибки,
			ТекстСообщенияXMLОтправлен,
			КодСостояния,
			Истина, РезультатЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область РазрешительныйРежимРозничнойПродажи

// Включает аварийный режим на определенное пользователем время;
// Аварийный режим подразумевает полное отключение запросов к ГИС МТ и розничную продажу
// отслеживаемых товарных групп без проверок разрешительного режима
// 
// Параметры:
//  СрокДействияВЧасах - Число - Срок включения аварийного режима в часах
Процедура ВключитьАварийныйРежимРазрешительнойСистемы(СрокДействияВЧасах = 0) Экспорт
	
	НастройкиСканирования    = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки();
	УниверсальнаяДатаТекущая = ТекущаяУниверсальнаяДата();
	
	Если СрокДействияВЧасах = 0 И ЗначениеЗаполнено(НастройкиСканирования.ЧастотаОбновленияCDNПлощадок) Тогда
		СрокДействияВЧасах = НастройкиСканирования.ЧастотаОбновленияCDNПлощадок;
	ИначеЕсли СрокДействияВЧасах = 0 Тогда
		// пока нет особых рекомендаций, аварийный режим включается на сутки
		СрокДействияВЧасах = 24;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиСканирования.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата)
		И УниверсальнаяДатаТекущая < НастройкиСканирования.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата Тогда
		ДатаОкончанияАварийногоРежима = НастройкиСканирования.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата + СрокДействияВЧасах * 3600;
	Иначе
		ДатаОкончанияАварийногоРежима = УниверсальнаяДатаТекущая + СрокДействияВЧасах * 3600;
	КонецЕсли;
	
	НастройкиСканирования.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата = ДатаОкончанияАварийногоРежима;
	
	КонстантаЗначение = Новый ХранилищеЗначения(НастройкиСканирования);
	Константы.НастройкиСканированияКодовМаркировкиИСМП.Установить(КонстантаЗначение);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Отключает действие аварийного режима
// Действие разрешительного режима возобновляется в штатном режиме
//
Процедура ОтключитьАварийныйРежимРазрешительнойСистемы() Экспорт
	
	НастройкиСканирования = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки();
	НастройкиСканирования.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата = Дата(1, 1, 1);
	
	КонстантаЗначение = Новый ХранилищеЗначения(НастройкиСканирования);
	Константы.НастройкиСканированияКодовМаркировкиИСМП.Установить(КонстантаЗначение);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Вовращает признак необходимости обновления площадок и их ранжированный список
//  от наиболее приоритетной по скорости отклика до наименее приоритетной
// 
// Возвращаемое значение:
//  Структура - структура данных CDN-площадок:
// * ТребуетсяОбновлениеПлощадок - Булево - признак, что все площадки либо заблокированы, либо не загружены,
//    либо срок их актуальности подошел к концу
// * ТаблицаПлощадок - ТаблицаЗначений - сортированный список CDN-площадок:
// ** АдресПлощадки - Строка - адрес площадки
// ** Сервер - Строка - адрес сервера
// ** Порт - Число - порт
// ** ЗащищенноеСоединение - Булево - защищенное соединение
// ** СкоростьОтклика - Число - общая скорость отклика, сумма среднего времени обработки КМ на площадке
//     и времени обращения к ней
// ** ПлощадкаДоступна - Булево - признак доступности площадки
Функция СортированнаяТаблицаCDNПлощадок() Экспорт
	
	ТаблицаПлощадок = Новый ТаблицаЗначений();
	ТаблицаПлощадок.Колонки.Добавить("АдресПлощадки",        ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаПлощадок.Колонки.Добавить("Сервер",               ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаПлощадок.Колонки.Добавить("Порт",                 ОбщегоНазначения.ОписаниеТипаЧисло(6));
	ТаблицаПлощадок.Колонки.Добавить("ЗащищенноеСоединение", Новый ОписаниеТипов("Булево"));
	ТаблицаПлощадок.Колонки.Добавить("СкоростьОтклика",      ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаПлощадок.Колонки.Добавить("ПлощадкаДоступна",     Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	CDNПлощадкиИСМП.АдресПлощадки                                               КАК АдресПлощадки,
		|	CDNПлощадкиИСМП.Сервер                                                      КАК Сервер,
		|	CDNПлощадкиИСМП.Порт                                                        КАК Порт,
		|	CDNПлощадкиИСМП.ЗащищенноеСоединение                                        КАК ЗащищенноеСоединение,
		|	CDNПлощадкиИСМП.СреднееВремяОтвета + CDNПлощадкиИСМП.СреднееВремяПроверкиКМ КАК СкоростьОтклика,
		|	CDNПлощадкиИСМП.ДатаНедоступнаДоУниверсальная < &ТекущаяУниверсальнаяДата   КАК ПлощадкаДоступна,
		|	ДОБАВИТЬКДАТЕ(CDNПлощадкиИСМП.ДатаОбновленияУниверсальная, ЧАС,
		|		&ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата                  КАК ПлощадкаАктуальна,
		|	CDNПлощадкиИСМП.СреднееВремяПроверкиКМ > 0
		|		И CDNПлощадкиИСМП.СреднееВремяОтвета > 0                                КАК БылПолученОтветПлощадки
		|ИЗ
		|	РегистрСведений.СостоянияCDNПлощадокИСМП КАК CDNПлощадкиИСМП
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПлощадкаДоступна УБЫВ,
		|	БылПолученОтветПлощадки УБЫВ,
		|	СкоростьОтклика";
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЧастотаОбновленияCDNПлощадок());
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьХотяБыОднаАктивнаяПлощадка = Ложь;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПлощадок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		Если Не ЕстьХотяБыОднаАктивнаяПлощадка
			И ВыборкаДетальныеЗаписи.ПлощадкаАктуальна Тогда
			ЕстьХотяБыОднаАктивнаяПлощадка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ТребуетсяОбновлениеПлощадок", Не ЕстьХотяБыОднаАктивнаяПлощадка);
	СтруктураВозврата.Вставить("ТаблицаПлощадок",             ТаблицаПлощадок);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Блокирует список CDN-площадок на время, указанное пользователем, 
//  или стандартный срок из настроек ИС МП
// 
// Параметры:
//  МассивПлощадок - Массив из Строка - Массив площадок к блокировке
//  ВремяБлокировки - Число - Время блокировки, если 0, то берется стандартное время блокировки
Процедура ЗаблокироватьСписокПлощадок(МассивПлощадок, ВремяБлокировки = 0) Экспорт
	
	Если МассивПлощадок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВремяБлокировки = 0 Тогда
		ВремяБлокировки = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВремяБлокировкиCDNПлощадки();
	КонецЕсли;
	
	Для Каждого АдресПлощадки Из МассивПлощадок Цикл
		
		МенеджерЗаписи = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.АдресПлощадки = АдресПлощадки;
		МенеджерЗаписи.Прочитать();
		
		Если Не МенеджерЗаписи.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи.ДатаНедоступнаДоУниверсальная = ТекущаяУниверсальнаяДата() + ВремяБлокировки * 60;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает признак необходимости запуска процедуры обновления списка CDN-площадок.
// 
// Возвращаемое значение:
//  Булево - Истина, если список площадок пуст (при первом запуске) или все площадки обновлены ранее
//   срока их актуальности
Функция ТребуетсяОбновлениеСпискаCDNПлощадок() Экспорт
	
	Если ОбщегоНазначенияИСМПВызовСервера.СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницуНаДату().Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьАктивныеПлощадки
		|ИЗ
		|	РегистрСведений.СостоянияCDNПлощадокИСМП КАК CDNПлощадкиИСМП
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(CDNПлощадкиИСМП.ДатаОбновленияУниверсальная, СЕКУНДА, &ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата";
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЧастотаОбновленияCDNПлощадок() * 3600);
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ТребуетсяОбновление = РезультатЗапроса.Пустой();
	
	Возврат ТребуетсяОбновление;
	
КонецФункции

// Длительная операция актуализации списка и времени отклика CDN-площадок
// 
// Параметры:
//  ПараметрыФоновогоЗадания - Структура - Параметры запуска фонового задания
//  АдресРезультата - Строка - адрес возврата результата
Процедура ВыполнитьАктуализациюCDNПлощадокДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ПараметрыФоновогоЗадания.Свойство("ПараметрыЛогированияЗапросовИСМП") Тогда
		
		ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
		ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
		ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
		ВыполнятьЛогирование = Истина;
		
	КонецЕсли;
	
	Если ПараметрыФоновогоЗадания.Свойство("ОбновлятьБезПроверкиДатыОбновления") И ПараметрыФоновогоЗадания.ОбновлятьБезПроверкиДатыОбновления Тогда
		ТребуетсяОбновлениеCDNПлощадок = Истина;
	Иначе
		ТребуетсяОбновлениеCDNПлощадок = ТребуетсяОбновлениеСпискаCDNПлощадок();
	КонецЕсли;
	
	Если Не ТребуетсяОбновлениеCDNПлощадок Тогда
		
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
		Возврат;
		
	КонецЕсли;
	
	РезультатОбновления = ИнтерфейсИСМПОбщегоНазначения.АктуализацияСпискаCDNПлощадок(ПараметрыФоновогоЗадания.Организация);
	
	Если ВыполнятьЛогирование Тогда
		ЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(ВозвращаемоеЗначение);
	КонецЕсли;
	
	Если РезультатОбновления.СписокПлощадок.Количество() Тогда
		
		РезультатЗаписи = ЗаписатьДанныеСостоянияCDNПлощадокВРегистр(РезультатОбновления.СписокПлощадок);
		
		Если РезультатЗаписи.Отказ Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатЗаписи.ТекстОшибки;
			
		ИначеЕсли ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки) Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатОбновления.ТекстОшибки;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ЕстьОшибки                            = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбновления.ТребуетсяОбновлениеКлючаСессииРозница;
		ВозвращаемоеЗначение.ТекстОшибки                           = РезультатОбновления.ТекстОшибки;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

// Запись данных площадок в регистр СостоянияCDNПлощадокИСМП
// 
// Параметры:
//  СписокПлощадок - Соответствие Из КлючИЗначение - полученные CDN-площадки:
//   * Ключ - Строка - Адрес площадки.
//   * Значение - (см. ИнтерфейсИСМП.ЗамерыСкоростиCDNПлощадок)
// Возвращаемое значение:
//   - Структура из КлючИЗначение:
//     * Отказ - Булево
//     * ТекстОшибки - Строка - заполнено, если Отказ = Истина
Функция ЗаписатьДанныеСостоянияCDNПлощадокВРегистр(СписокПлощадок) Экспорт
	
	РезультатВозврата = Новый Структура("Отказ, ТекстОшибки", Ложь, "");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияCDNПлощадокИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
	
		НаборЗаписей = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		Для Каждого СтрокаСпискаПлощадок Из СписокПлощадок Цикл
			
			ЗаписьРегистра = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьМенеджерЗаписи();
			
			ЗаписьРегистра.АдресПлощадки          = СтрокаСпискаПлощадок.Ключ;
			ЗаписьРегистра.СреднееВремяОтвета     = СтрокаСпискаПлощадок.Значение.СреднееВремяОтвета;
			ЗаписьРегистра.СреднееВремяПроверкиКМ = СтрокаСпискаПлощадок.Значение.СреднееВремяПроверкиКМ;
			
			ЗаписьРегистра.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		РезультатВозврата.Отказ       = Истина;
		РезультатВозврата.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатВозврата;
	
КонецФункции

#КонецОбласти

// Инициализация таблицы протокола обмена элемента очереди из ИС МП
// Параметры:
//  ВключитьКодСостояния - Булево - признак, добавлять ли в таблицу колонку КодСостояния
//
// Возвращаемое значение:
//  ТаблицаЗначений - Описание:
//  * ДатаУниверсальная - Дата - Дата.
//  * Операция - ПеречислениеСсылка.ВидыОперацийИСМП - вид операции.
//  * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП - статус обработки сообщения.
//  * Запрос - Строка - запрос.
//  * ЗапросЗаголовки - Строка - заголовки запроса.
//  * ЗапросТело - Строка - тело запроса.
//  * ОтветЗаголовки - Строка - заголовки ответа.
//  * ОтветТело - Строка - ответ.
//  * КодСостояния - Строка - код состояния запроса.
Функция ИнициализироватьТаблицуПротоколОбмена(ВключитьКодСостояния = Ложь) Экспорт
	
	ПротоколОбмена = Новый ТаблицаЗначений;
	ПротоколОбмена.Колонки.Добавить("ДатаУниверсальная", Новый ОписаниеТипов("Дата"));
	ПротоколОбмена.Колонки.Добавить("Операция",          Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийИСМП"));
	ПротоколОбмена.Колонки.Добавить("СтатусОбработки",   Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП"));
	ПротоколОбмена.Колонки.Добавить("Запрос",            Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ЗапросЗаголовки",   Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ЗапросТело",        Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ОтветЗаголовки",    Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ОтветТело",         Новый ОписаниеТипов("Строка"));
	Если ВключитьКодСостояния Тогда
		ПротоколОбмена.Колонки.Добавить("КодСостояния", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Возврат ПротоколОбмена;
	
КонецФункции

Функция ЗаголовкиИзHTTPОтвета(HTTPОтвет) Экспорт
	
	ОтветЗаголовки = Новый Массив;
	
	ИгноруемыеЗаголовки = Новый Соответствие;
	ИгноруемыеЗаголовки.Вставить(ВРег("Set-Cookie"),             Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Expires"),                Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Via"),                    Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Connection"),             Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Proxy-Connection"),       Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Server"),                 Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Vary"),                   Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("X-Frame-Options"),        Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Transfer-Encoding"),      Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Pragma"),                 Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("X-Content-Type-Options"), Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("X-XSS-Protection"),       Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Cache-Control"),          Истина);
	
	Для Каждого КлючИЗначение Из HTTPОтвет.Заголовки Цикл
		Заголовок = КлючИЗначение.Ключ;
		Если ИгноруемыеЗаголовки[ВРег(Заголовок)] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОтветЗаголовки.Добавить(
			СтрШаблон("%1: %2", Заголовок, КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СтрСоединить(ОтветЗаголовки, Символы.ПС);
	
КонецФункции

Функция URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод) Экспорт

	Если ПараметрыОтправкиHTTPЗапросов.ИспользоватьЗащищенноеСоединение Тогда
		Протокол = "https";
	Иначе
		Протокол = "http";
	КонецЕсли;
	
	URLЗапроса = СтрШаблон(
		"%1 %2://%3:%4/%5",
		HTTPМетод,
		Протокол,
		ПараметрыОтправкиHTTPЗапросов.Сервер,
		Формат(ПараметрыОтправкиHTTPЗапросов.Порт, "ЧГ=0;"),
		HTTPЗапрос.АдресРесурса);
	
	Возврат URLЗапроса;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Выполняет установку параметров сеанса. Вызывается из модуля сеанса.
//
// Параметры:
//  ИмяПараметра			 - Строка - имя параметра сеанса.
//  УстановленныеПараметры	 - Массив - все установленные параметры сеанса.
//
Процедура УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = Метаданные.ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП.Имя Тогда
		ЛогированиеЗапросовИС.УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры);
	ИначеЕсли ИмяПараметра = "ДанныеКлючаСессииСУЗ" Тогда
		ПараметрыСеанса.ДанныеКлючаСессииСУЗ = Новый ХранилищеЗначения(Неопределено);
		Если ТипЗнч(УстановленныеПараметры) = Тип("Массив") Тогда
			УстановленныеПараметры.Добавить(ИмяПараметра);
		ИначеЕсли ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить(ИмяПараметра);
		КонецЕсли;
	ИначеЕсли ИмяПараметра = Метаданные.ПараметрыСеанса.ДанныеКлючаСессииИСМП.Имя Тогда
		ПараметрыСеанса.ДанныеКлючаСессииИСМП = Новый ХранилищеЗначения(Неопределено);
		Если ТипЗнч(УстановленныеПараметры) = Тип("Массив") Тогда
			УстановленныеПараметры.Добавить(ИмяПараметра);
		ИначеЕсли ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить(ИмяПараметра);
		КонецЕсли;
	ИначеЕсли ИмяПараметра = Метаданные.ПараметрыСеанса.ДанныеКлючаСессииИСМПРозница.Имя Тогда
		ПараметрыСеанса.ДанныеКлючаСессииИСМПРозница = Новый ХранилищеЗначения(Неопределено);
		Если ТипЗнч(УстановленныеПараметры) = Тип("Массив") Тогда
			УстановленныеПараметры.Добавить(ИмяПараметра);
		ИначеЕсли ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить(ИмяПараметра);
		КонецЕсли;
	ИначеЕсли ИмяПараметра = Метаданные.ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП.Имя Тогда
		ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(Новый Массив());
		Если ТипЗнч(УстановленныеПараметры) = Тип("Массив") Тогда
			УстановленныеПараметры.Добавить(ИмяПараметра);
		ИначеЕсли ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить(ИмяПараметра);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// см. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиента
Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	
	ИменаПараметров  = ОбщегоНазначенияИСМПКлиентСервер.ИменаПараметровРаботыКлиента();
	
	Параметры.Вставить(
		ИменаПараметров.ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом, 
		ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом());
	
КонецПроцедуры

// Возвращает признак, поддерживает ли БПО логирование проверок КМ и проверку КМ единым методом
// 
// Возвращаемое значение:
//  Булево - Истина, если версия БПО выше 3.2.2.24
Функция ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом() Экспорт
	
	Возврат ОбщегоНазначенияИСМППовтИсп.ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом();
	
КонецФункции

#КонецОбласти

// Минимальная цена розничной продажи табачной продукции.
// 
// Возвращаемое значение:
//  Структура - Минимальная цена розничной продажи табачной продукции:
// * МинРЦ - Число - минимальная розничная цена табачной продукции
// * ЗагруженыАктуальныеЦены - Булево - Истина, если загружена минимальная цена
Функция МинимальнаяЦенаРозничнойПродажиТабачнойПродукции() Экспорт
	
	СтруктураМинимальнойЦены = Новый Структура;
	СтруктураМинимальнойЦены.Вставить("МинРЦ",                   0);
	СтруктураМинимальнойЦены.Вставить("ЗагруженыАктуальныеЦены", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МинимальныеЦеныПодакцизныхТоваровИС.МинимальнаяЦена КАК МинимальнаяЦена
		|ИЗ
		|	РегистрСведений.МинимальныеЦеныПодакцизныхТоваровИС КАК МинимальныеЦеныПодакцизныхТоваровИС
		|ГДЕ
		|	МинимальныеЦеныПодакцизныхТоваровИС.ВидПодакцизногоТовара = &ВидПодакцизногоТовара
		|	И МинимальныеЦеныПодакцизныхТоваровИС.ДатаНачалаДействия <= &ДатаПроверки
		|	И МинимальныеЦеныПодакцизныхТоваровИС.ДатаОкончанияДействия >= &ДатаПроверки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МинимальныеЦеныПодакцизныхТоваровИС.МинимальнаяЦена
		|ИЗ
		|	РегистрСведений.МинимальныеЦеныПодакцизныхТоваровИС КАК МинимальныеЦеныПодакцизныхТоваровИС
		|ГДЕ
		|	МинимальныеЦеныПодакцизныхТоваровИС.ВидПодакцизногоТовара = &ВидПодакцизногоТовара
		|	И МинимальныеЦеныПодакцизныхТоваровИС.ДатаНачалаДействия <= &ДатаПроверки
		|	И МинимальныеЦеныПодакцизныхТоваровИС.ДатаОкончанияДействия = &Актуальная";
	
	Запрос.УстановитьПараметр("Актуальная",            Дата("00010101"));
	Запрос.УстановитьПараметр("ВидПодакцизногоТовара", Перечисления.ВидыПодакцизныхТоваровИС.ТабачнаяПродукция);
	Запрос.УстановитьПараметр("ДатаПроверки",          ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураМинимальнойЦены.МинРЦ = ВыборкаДетальныеЗаписи.МинимальнаяЦена;
		СтруктураМинимальнойЦены.ЗагруженыАктуальныеЦены = Истина;
	КонецЦикла;
	
	Возврат СтруктураМинимальнойЦены;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РасширенныеОбработкиОтправкиДанныхВСервис(ПараметрыОтправкиHTTPЗапросов)
	
	Если ЭтоРасширеннаяВерсияГосИС() Тогда
		
		//@skip-check wrong-string-literal-content
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСМП");
		Модуль.ОбработатьОжиданиеПриОтправкеДанныхВСервис(ПараметрыОтправкиHTTPЗапросов);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает таблицу кодов маркировки с минимальными и максимальными розничными ценами
//
// Параметры:
//  ШтрихкодыУпаковок - ТаблицаЗначений - коды маркировки, по которым осуществляется проверка
//  * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров, Строка
//
// Возвращаемое значение:
//  ТаблицаЗначений - результаты проверки:
//  * Номенклатура             - СправочникСсылка.Номенклатура - номенклатура из штрихкода
//  * Характеристика           - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика из штрихкода
//  * Серия                    - СправочникСсылка.СерииНоменклатуры - серия из штрихкода
//  * МРЦ                      - Число - максимальная розничная цена, указанная в коде маркировки
//  * МинимальнаяРозничнаяЦена - Число - установленная минимальная розничная цена табачной продукции
//  * ТекстОшибки              - Строка - ошибка разбора кода маркировки
//  * КодМаркировки            - Строка - значение из штрихкода
//  * НарушениеМРЦ             - Булево - Истина, если МРЦ меньще установленной законодательством минимальной розничной цены
//
Функция МинимальныеЦеныТабачнойПродукции(ШтрихкодыУпаковок, Параметры) Экспорт
	
	МинимальнаяРозничнаяЦена         = 0;
	МинимальнаяЦенаТабачнойПродукции = МинимальнаяЦенаРозничнойПродажиТабачнойПродукции();
	
	Если МинимальнаяЦенаТабачнойПродукции.ЗагруженыАктуальныеЦены Тогда
		МинимальнаяРозничнаяЦена = МинимальнаяЦенаТабачнойПродукции.МинРЦ;
	КонецЕсли;
	
	РезультатыПроверки = Новый ТаблицаЗначений;
	РезультатыПроверки.Колонки.Добавить("Номенклатура",             Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	РезультатыПроверки.Колонки.Добавить("Характеристика",           Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	РезультатыПроверки.Колонки.Добавить("Серия",                    Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	РезультатыПроверки.Колонки.Добавить("МРЦ",                      ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	РезультатыПроверки.Колонки.Добавить("МинимальнаяРозничнаяЦена", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	РезультатыПроверки.Колонки.Добавить("ТекстОшибки",              ОбщегоНазначения.ОписаниеТипаСтрока(40));
	РезультатыПроверки.Колонки.Добавить("КодМаркировки",            ОбщегоНазначения.ОписаниеТипаСтрока(150));
	РезультатыПроверки.Колонки.Добавить("НарушениеМРЦ",             Новый ОписаниеТипов("Булево"));
	
	ВидПродукцииТабак           = Перечисления.ВидыПродукцииИС.Табак;
	ПримечаниеКРазборуШтрихкода = Новый Структура;
	ШтрихкодыУпаковокТоваров    = Новый Массив;
	
	Для каждого ШтрихкодНаПроверку Из ШтрихкодыУпаковок Цикл
		Если ТипЗнч(ШтрихкодНаПроверку) = Тип("Строка") Тогда
			СтрокаРезультатПроверки = РезультатыПроверки.Добавить();
			РезультатыПроверки.КодМаркировки = ШтрихкодНаПроверку;
		Иначе
			ШтрихкодыУпаковокТоваров.Добавить(ШтрихкодНаПроверку);
		КонецЕсли;
	КонецЦикла;
	
	Если ШтрихкодыУпаковокТоваров.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Представление КАК КодМаркировки,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка В(&МассивШтрихкодов)";
		
		Запрос.УстановитьПараметр("МассивШтрихкодов", ШтрихкодыУпаковокТоваров);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаРезультатПроверки = РезультатыПроверки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультатПроверки, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого СтрокаУпаковок Из РезультатыПроверки Цикл
		МаксимальнаяРозничнаяЦена = 0;
		
		ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(СтрокаУпаковок.КодМаркировки, ВидПродукцииТабак, ПримечаниеКРазборуШтрихкода);
		
		СтрокаУпаковок.МинимальнаяРозничнаяЦена = МинимальнаяРозничнаяЦена;
		
		Если ЗначениеЗаполнено(ПримечаниеКРазборуШтрихкода.ИдентификаторОшибки) Тогда
			СтрокаУпаковок.ТекстОшибки = ПримечаниеКРазборуШтрихкода.ТекстОшибки;
		Иначе
			СоставКодаМаркировки = ДанныеРазбора.СоставКодаМаркировки;
			
			СоставКодаМаркировки.Свойство("МРЦ", МаксимальнаяРозничнаяЦена);
			
			Если МаксимальнаяРозничнаяЦена <> Неопределено И МаксимальнаяРозничнаяЦена > 0 Тогда
				СтрокаУпаковок.МРЦ = МаксимальнаяРозничнаяЦена;
				
				Если МаксимальнаяРозничнаяЦена < МинимальнаяРозничнаяЦена Тогда
					СтрокаУпаковок.НарушениеМРЦ = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатыПроверки;
	
КонецФункции

#КонецОбласти
